{
    "result": [
        
             {
            "title": "Windows CMD Commands You Must know",
            "url": "/article.html?view=article-4-2080",
            "description": "Windows CMD Commands Cheat Sheet",
            "content":"<h2>Files and Folders Management</h2><ul><li><b>COPY</b> - Copies files to another location</li><li><b>DIR</b> – Displays files and folders in the current directory</li><li><b>DEL or ERASE</b> - Deletes files</li><li><b>EDIT</b> - Starts file editor</li><li><b>CD</b> - Changes directory</li><li><b>EXPAND</b> - Decompresses compressed files</li><li><b>FC</b> - Compares files and shows the differences between them</li><li><b>FIND</b> - Finds a text string in the file</li><li><b>MD or MAKEDIR</b> - Creates a folder</li><li><b>MOVE</b> - Moves files from one folder to another</li><li><b>PRINT</b> - Prints out the text file contents</li><li><b>RD or RMDIR</b> - Deletes a folder</li><li><b>REN or RENAME</b> - Renames a file or folder</li><li><b>REPLACE</b> - Replaces files in one directory with files of the same name in another directory (overwrite)</li><li><b>ROBOCOPY</b> - Uses an advanced tool to copy files and directories</li><li><b>TREE</b> - Shows directory structure of a disk or folder</li><li><b>TYPE</b> - Displays the contents of text files</li><li><b>OPENFILES</b> – Manages opened local or network files</li><li><b>XCOPY</b> - Copies files and directory trees</li></ul><h2>Applications and Processes</h2><ul><li><b>SCHTASKS</b> - Executes a command or starts a scheduled application (Task Scheduler)</li><li><b>SHUTDOWN</b> - Shuts down or reboots your computer</li><li><b>TASKLIST</b> - Lists the tasks being performed</li><li><b>TASKKILL</b> - Stops or halts a task (to stop a task, you use a PID which you can find out from TASKLIST)</li><li><b>REG</b> – Starts registry editor</li><li><b>RUNAS</b> - Launches the task as another user</li></ul><h2>Disks Management</h2><ul><li><b>CHKDISK</b> - Checks disk and shows statistics</li><li><b>DEFRAG</b> – Starts disk defragmentation</li><li><b>CHKNTFS</b> - Displays or changes execution of disk check at boot</li><li><b>COMPACT</b> - Displays and changes the compression of files in NTFS partitions</li><li><b>CONVERT</b> - Converts FAT disk volume to NTFS</li><li><b>DISKPART</b> - Displays and adjusts disk partition properties</li><li><b>FORMAT</b> - Formats the disk</li><li><b>FSUTIL</b> - Displays and configures file system properties</li><li><b>LABEL</b> - Creates, changes, or deletes a disk volume label</li><li><b>RECOVER</b> - Recovers data from a bad or damaged disk</li><li><b>VOL</b> - Displays volume label and serial number for the disk</li></ul><h2>System Information</h2><ul><li><b>DATE</b> - Outputs or sets the current date</li><li><b>TIME</b> - Displays or sets the system time</li><li><b>DRIVERQUERY</b> - Displays the current state and properties of the device driver</li><li><b>HOSTNAME</b> - Displays name of the computer</li><li><b>SYSTEMINFO</b> - Shows configuration information about your computer</li><li><b>VER</b> - Allows you to view the Windows version</li><li><b>GPRESULT</b> – Displays current applied group policies (RSoP)</li><li><b>GPUPDATE</b> – Updates group policies</li></ul><h2>Network</h2><ul><li><b>IPCONFIG</b> - Shows information about network interfaces</li><li><b>PING</b> – Sends ICMP requests to the target host, checks host availability</li><li><b>TRACERT</b> - Finds the path for packets traveling over the network</li><li><b>NSLOOKUP</b> - Finds IP address by resource name</li><li><b>ROUTE</b> - Displays network route tables</li><li><b>ARP</b> - Shows a table with IP addresses converted into physical addresses</li><li><b>NETSH</b> – Starts a network settings control program</li><li><b>GETMAC</b> - Shows the MAC address of the network adapter</li><li><b>TFTP</b> – Starts TFTP client in console</li></ul><h2>Command Line Setup</h2><ul><li><b>CLS</b> - Clears screen</li><li><b>CMD</b> - Displays another command prompt</li><li><b>COLOR</b> - Sets the text and background color</li><li><b>PROMPT</b> - Changes the command line prompt</li><li><b>TITLE</b> - Assigns a title for the current session</li><li><b>HELP</b> – Launches CMD help</li><li><b>EXIT</b> - Exits the command line</li></ul>",
            "featured": "false",
            "image_url": "https://www.digitalcitizen.life/wp-content/uploads/2021/07/windows_terminal-7.png",
            "github_link": "#",
            "tag": "Article"
        },
        {
            "title": "xupa-rustam",
            "url": "/article.html?view=xupa-rustam-2080",
            "description": "Python based Pentesting Brute-Force tool to crack username and password of a simple traditional website ",
            "content": "Description \n --- \n This Python based Pentesting CLI tool is made to host Brute-Force attack using requests module, and for keeping anonymity of the attacker's IP address Tor proxy is being used. The brute force works upon user defined admin and password list which tries each password from the list to every admin from the list. \n --- \n Installation \n --- \n $ git clone https://github.com/devsdenepal/xupa-rustam \n --- \n Contribute \n --- \n If you have any idea or suggestions to improve the code or interface, you can simply create a PR to this repo.",
            "featured": "false",
            "image_url": "https://raw.githubusercontent.com/devsdenepal/xupa-rustam/main/screenshots/IMG-20230403-WA0022.jpg",
            "github_link": "https://github.com/Krimson-Squad/xupa-rustam",
            "tag": "Python"
        },
        {
            "title": "Andro-Predom",
            "url": "/article.html?view=andro-predom-2080",
            "description": "A Pentesting tool aimed to expose the possible risks of exploiting an android phone through adb commands simulated through the programme which comprises a range of exploiting and exposing features. ",
            "content": "Description \n --- \n Android-Predom is a powerful tool that interacts with the Android Debug Bridge (ADB) and is inspired by the popular Python-based exploiting tool Ghost.\n This tool is a part of a private project called PREDOMINANT and is designed to be fully integrated into the shell. The tool provides many new features and is actively being updated by the developer. \n One of the key advantages of Android-Predom is that it does not require root control over the device. This is a significant improvement over other projects that interact with ADB, as they often require root access and can be difficult to use. \n This tool is user-friendly and easy to use, making it a great option for both novice and experienced developers.Another important feature of Android-Predom is that it is constantly being updated. \n  The developer is actively working on improving the tool and adding new features, making it a powerful and versatile option for developers. This tool is continuously updated to support the new versions of Android and is known for its stability and reliability. \n One of the most important aspects of Android-Predom is that it is a part of a larger project called PREDOMINANT. The ultimate goal of this project is to create a comprehensive set of tools for Android app development, making it easier for developers to create and test their apps. \n The developer is continuously working on integrating new features and tools into the project, making it a one-stop solution for all Android app development needs.\n In conclusion, Android-Predom is a powerful and versatile tool for Android app development. It is user-friendly, does not require root access, and is actively being updated by the developer. The tool is a part of a larger project called PREDOMINANT which aims to provide a comprehensive set of tools for Android app development. \n We hope that you will give Android-Predom a try and experience the benefits it has to offer."
,
            "featured": "false",
            "image_url": "https://github.com/devsdenepal/andro-predom/raw/main/ScreenShot_20230101193530.jpeg",
            "github_link": "https://github.com/Krimson-Squad/andro-predom",
            "tag": "Shell"
        },
        {
            "title": "PhantomBlitz",
            "url": "/article.html?view=phantomblitz-2080",
            "description": "PhantomBlitz: Yet another tool for reverse shell execution & payload generator by Dev. Gautam Kumar ",
            "content": "Description \n --- \n PhantomBlitz is a Python-based framework that creates an executable file with various parameters. It allows users to perform a reverse TCP connection and execute cmd commands.\n ---\n Usage \n --- \n PhantomBlazer can be executed with the following parameters: \n --mode/-m: Mode: accepts > build or listen \n   --lhost/-lh: The local host IP address \n  --lport/-lp: The local port number \n     --output/-o: The output file name \n Example:  python3 phantomblazer.py -m build --lh <ip.address> --lp <port> --output<application.name>.exe Before payload execution on client: python3 phantomblazer.py -m listen --lh <ip.address> -lp <port> \n --- \n DISCLAIMER \n ---\n This tool is intended for legal and ethical use only. The creator of this tool is not responsible for any illegal or unethical use of this tool. \n The tool creates a .exe file which runs as a background and creates a reverse TCP connection, allowing for remote command execution. This tool is intended for debugging purposes and should not be used to gain unauthorized access to systems. \n Please use this tool at your own risk and with the appropriate permissions from the system owners. Any actions taken with this tool are the sole responsibility of the user. \n By using this tool, you agree to the terms and conditions outlined above and acknowledge that any misuse of this tool is strictly prohibited.",
            "featured": "false",
            "image_url": "https://user-images.githubusercontent.com/111997815/235445673-e72f087d-ce6f-4737-a1eb-f36e1fcf4aad.png",
            "github_link": "https://github.com/Krimson-Squad/PhantomBlitz",
            "tag": "Python"
        },
        {
            "title":"ShadowCipher",
            "url":"/article.html?view=shadow-cipher-2080",
            "description":"A simple tool that allows you to generate wordlists based on first and last names. It provides various patterns and variations to create a wide range of potential words for password cracking, data analysis, or other purposes. ",
            "content":"Description \n --- \n The ShadowCipher is a simple tool that allows you to generate wordlists based on first and last names. It provides various patterns and variations to create a wide range of potential words for password cracking, data analysis, or other purposes. \n --- \n Usage \n --- \n To use the ShadowCipher, follow the steps below: \n Clone the repository or download the ShadowCipher.py file.  \n Ensure you have Python 3 installed on your machine.  \n Open a terminal or command prompt and navigate to the directory where ShadowCipher.py is located.  \n Run the following command:  \n python ShadowCipher.py [-h] [-n COUNT] [-sv FILE_NAME] first_name last_name  \n Replace first_name with the target's first name. \n Replace last_name with the target's last name. \n Use the optional -n flag followed by the desired count to specify the number of words to generate (default: 100). \n Example: python ShadowCipher.py -n 500 John Doe -sv johndoe_wordlist.txt  \n The tool will generate a wordlist based on the provided names and display the total number of words generated.",
            "featured":"true",
            "image_url":"https://camo.githubusercontent.com/b2808f38f0076526f17deec355ac5bbf8d41526dbab32073fdf5c6349bc22549/68747470733a2f2f63646e2e646973636f72646170702e636f6d2f6174746163686d656e74732f3439323335313134353330363735313030342f313132363034383434363532393431373233362f696d6167652e706e67",
            "github_link":"https://github.com/Krimson-Squad/ShadowCipher",
            "tag":"Python"
            },
            {
                "title": "GitHub Actions : Beginner’s Insight into Streamlining Workflows",
                "url": "/article.html?view=article-03-2080",
                "description": "The GitHub Actions has been a game-changer for me. The sheer power of automating workflows, enabling seamless code building, testing, and deployment directly from GitHub, has transformed the way I approach development.",
                "content":"Medium Article (Click title to see) \n --- \n If you’ve absolutely no idea of what Github Action does, think of it as a helpful assistant that takes charge of testing and deploying your code automatically. It functions like a tool that does the heavy lifting — building, checking, and dispatching your code without needing your constant manual intervention. With its setup, you ensure that each time you make changes, your code gets thoroughly tested, and once it meets the criteria, it’s smoothly sent to its destination.",
                "featured": "false",
                "image_url": "https://miro.medium.com/v2/resize:fit:720/format:webp/1*A6WaXCcfDEfTl08DJUoTdw.gif",
                "github_link": "https://medium.com/towardsdev/github-actions-starter-pack-beginners-insight-into-streamlining-workflows-36332416992d",
                "tag": "Article"
            },
            {
                "title": "unvetion",
                "url": "/article.html?view=unvetion-2080",
                "description": "MINI RECON PROJECT.",
                "content": "loading...",
                "featured": "false",
                "image_url": "https://github.com/Krimson-Squad/unvetion/blob/main/Screenshot%202023-09-16%20171301.png?raw=true",
                "github_link": "https://github.com/Krimson-Squad/unvetion",
                "tag": "Python"
            },
            {
                "title": "Foundations for Fluent Code: Essential Tips for Beginner Programmers",
                "url": "/article.html?view=article-02-2080",
                "description": "Whether you code for leisure or as a profession, maintaining fluency in your code is crucial. Picture a scenario: your project is functioning well, and you’re eager to enhance it with additional plugins, features, or modules. However, when asking a colleague to contribute, their reluctance becomes apparent as the code lacks clarity and is challenging to modify.",
                "content":"Medium Article (Click title to see) \n --- \n The code refers to the process of inputting commands using a specific language that computers can interpret, allowing for the construction of websites, applications, and software. But, what is Fluent? \n The subject we’re discussing is commonly known as “Coding Practices”. \nHere we’re using term fluent, for the code which can be:- \n - Modified Easily \n - Read \n - Safe \n- Efficient",
                "featured": "false",
                "image_url": "https://miro.medium.com/v2/resize:fit:1100/format:webp/1*vsd5MYsjY0H0uVfNPP8aPA.png",
                "github_link": "https://medium.com/@devgautamkumar/foundations-for-fluent-code-essential-tips-for-beginner-programmers-55925c881495",
                "tag": "Article"
            },
            {
                "title": "Common Techniques & Software ",
                "url": "/article.html?view=common-techniques-n-software-2080",
                "description": "List of common T1 and SO(s) used by Threat groups.",
                "content": "loading...",
                "featured": "false",
                "image_url": "https://github.com/Krimson-Squad/common-techniques-n-software/assets/111997815/4fa87712-b119-4779-810a-227b3d76c48b",
                "github_link": "https://github.com/Krimson-Squad/common-techniques-n-software",
                "tag": "Markdown"
            },
            {
                "title": "Factors Influencing Password Choices: A Comprehensive Guide to Password Security",
                "url": "/article.html?view=article-01-2080",
                "description": "Passwords are the keys that unlock our digital lives. They protect our personal information, online accounts, and sensitive data from cybercriminals. Yet, many people still use weak and easily guessable passwords, putting themselves and their online identities at risk. In this article, we’ll explore the different factors that influence password choices and provide tips on how to create strong and secure passwords.",
                "content":"Medium Article (Click title to see) \n --- \n Password security is essential for protecting our online identities and sensitive information. It’s important to create strong and secure passwords that are difficult to guess or crack. By following the factors outlined in this article, such as memorability, complexity, length, personal background, security requirements, and convenience, you can create passwords that are both easy to remember and secure.",
                "featured": "false",
                "image_url": "https://miro.medium.com/v2/resize:fit:720/format:webp/1*ma2jzUHQvkz9EfeVrvtXsw.jpeg",
                "github_link": "https://medium.com/@devgautamkumar/factors-influencing-password-choices-a-comprehensive-guide-to-password-security-719b90d78d38",
                "tag": "Article"
            },
     
      
        {
            "title": "WebSecProbe",
            "url": "/article.html?view=webSecProbe-2080",
            "description": "Web Application Vulnerability Scanning using Python and browser automation libraries allowing efficient scanning of web application.",
            "content": "loading...",
            "featured": "false",
            "image_url": "N/A",
            "github_link": "https://github.com/Krimson-Squad/WebSecProbe",
            "tag": "Python"
        },
   
            {
                "title": "AndherNagri",
                "url": "/article.html?view=andhernagri-2080",
                "description": "A vulnerable site to practice XSS and SQL injection.",
                "content": "A vulnerable site to practice XSS and SQL injection. \n We updated a demo banking dbms to be vulnerable to practice with, in according to our tutorial video.",
                "featured": "false",
                "image_url": "N/A",
                "github_link": "https://github.com/Krimson-Squad/AndherNagri",
                "tag": "PHP"
            }
    ]
}
